//
//  SectionHelpViewController.swift
//  DrumTrainerDemoApp
//
//  Created by Dmitrii Melnikov on 07.02.2023.
//

import UIKit

class SectionHelpViewController: UIViewController {

    @IBOutlet var helpTextLabel: UILabel!
    
    @IBOutlet var helpTextView: UITextView!
    override func viewDidLoad() {
        super.viewDidLoad()
        helpTextView.text = "   Это раздел обучения. Здесь вы будете учиться правильно держать палочки, развивать координацию, динамику, скорость игры, учить базовые ритмические паттерны и, самое главное, учиться, как правильно учиться. В игре на барабанах скорость является одним из самых важных факторов. Но скорость без остальных факторов, таких как координация и ровность игры, не представляет абсолютно никакой ценности. Зато ровная расслабленная игра будет хорошо звучать как на высоких скоростях, так и на низких. Новички зачастую забывают или не знают об этом, и стараются играть как можно быстрее. Из-за этого их игра звучит скомкано, грязно и напряжённо. Таким людям придётся очень долго переучиваться, если они конечно не забросят игру на барабанах. Вам же повезло наткнуться на это приложение, которое поможет вам в освоении правильной техники игры. Существует только один правильный способ учебы игре на барабанах. Им пользуются как новички, так и те, кто играет очень давно. Главная мысль этого способа: скорость придёт с практикой, над всем остальным нужно потрудиться. В этом разделе вы будете шаг за шагом изучать новые для вас упражнения и паттерны. Сначала вы будете играть в очень медленных темпах. Вы не сможете перейти на более высокий темп до тех пор, пока не уделите достаточное количество времени тому темпу, до которого вы уже дошли. Ваша задача добиться расслабленной ровной игры с необходимой динамикой и правильным хватом палочки. Помните, когда у вас появляется возможность повысить темп, вы должны оценить то, как вы справляетесь. Если вы чувствуете зажимы в руках, если вы сбиваетесь, если вы играете не ровно или если вам сложно, то не повышайте темп, а лучше понизьте его на 1-2 ступени. Скорость рано или придёт в любом случае. Для начала посмотрите следующее видео, после чего можно будет приступить к тренировке."
            }
    
}
